jad-eng/Custom-Board/Custom_board/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Arduino MKRZero
# ---------------
Custom.name=Custom
#Custom.vid.0=0x1354
#Custom.pid.0=0x4000

Custom.upload.tool=bossac
Custom.upload.protocol=sam-ba
Custom.upload.maximum_size=262144
Custom.upload.use_1200bps_touch=true
Custom.upload.wait_for_upload_port=true
Custom.upload.native_usb=true
Custom.build.mcu=cortex-m0plus
Custom.build.f_cpu=48000000L
Custom.build.usb_product="Arduino MKRZero"
Custom.build.usb_manufacturer="Arduino LLC"
Custom.build.board=SAMD_MKRZERO
Custom.build.core=arduino
Custom.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
Custom.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Custom.build.openocdscript=openocd_scripts/arduino_zero.cfg
Custom.build.variant=mkrzero
Custom.build.vid=0x2341
Custom.build.pid=0x804f
Custom.bootloader.tool=openocd
Custom.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin
